//   ロボット名	： 電研ベーシックDCマウス、サンシャイン
//   概要		： initファイル（レジスタ設定ファイル他）のヘッダファイル
//   注意		： なし
//   メモ		： なし
//   引数		： なし
//   返り値		： なし
// **************************    履    歴    *******************************
// 		v1.0		2018.06.28			sato			新規（ファイルのインクルード）
// *************************************************************************/
// 多重コンパイル抑止
#ifndef _INIT_H
#define _INIT_H

//**************************************************
// インクルードファイル（include）
//**************************************************
#include <typedefine.h>						// 定義
#include <iodefine.h>						// I/O

//**************************************************
// 定義（define）
//**************************************************
#define LED4	(PORTE.PODR.BYTE)		//下位ビットのみで使用上位ビットを使わないこと
#define LED4_ALL_OFF	(0x00)
#define LED4_ALL_ON		(0x0f)

#define LEDR	(PORTE.PODR.BIT.B4)
#define LEDG	(PORTE.PODR.BIT.B5)

/*スイッチ*/
#define		SW_INC_PIN		(PORTC.PIDR.BIT.B2)			// モード切り替え
#define		SW_EXE_PIN		(PORTC.PIDR.BIT.B3)			// モード実行
#define		SW_ON			(OFF)						// Pull-Upのため、ON-OFFが論理反転さている
#define		SW_OFF			(ON)						// Pull-Upのため、ON-OFFが論理反転さている

/*エンコーダ*/
#define		ENC_R_TCNT	(TPU1.TCNT)
#define		ENC_L_TCNT	(TPU2.TCNT)

//**************************************************
// 列挙体（enum）
//**************************************************


//**************************************************
// 構造体（struct）
//**************************************************


//**************************************************
// グローバル変数
//**************************************************




//**************************************************
// プロトタイプ宣言（ファイル内で必要なものだけ記述）
//**************************************************

PUBLIC void CPU_init(void);

#endif	