// *************************************************************************
//   ロボット名	： 電研ベーシックDCマウス、サンシャイン
//   概要		： サンシャインのmodeファイル
//   注意		： なし
//   メモ		： なし
//   引数		： なし
//   返り値		： なし
// **************************    履    歴    *******************************
// 		v1.0		2017.08.25			sato		新規（ファイルのインクルード）
// *************************************************************************/


//**************************************************
// インクルードファイル（include）
//**************************************************
#include <typedefine.h>						// 定義
#include <iodefine.h>						// I/O
#include <hal.h>						// HAL
#include <stdio.h>
#include <search.h>
#include <parameters.h>
#include <init.h>
#include <hal_dist.h>

//**************************************************
// 定義（define）
//**************************************************


//**************************************************
// 列挙体（enum）
//**************************************************

//**************************************************
// 構造体（struct）
//**************************************************

//**************************************************
// グローバル変数
//**************************************************



//**************************************************
// プロトタイプ宣言（ファイル内で必要なものだけ記述）
//**************************************************


// *************************************************************************
//   機能		： 前壁（右）が閾値以上だとフラグが立つ
//   注意		： なし
//   メモ		： なし
//   引数		： なし
//   返り値		： 検知した:true　検知できなかった:false
// **************************    履    歴    *******************************
// 		v1.0		2017.08.28			sato		新規
// *************************************************************************/
PUBLIC BOOL MODE_DistRightCheck(void)
{
	SHORT s_rightval;
	BOOL bl_check;
	
	s_rightval = DIST_getNowVal(DIST_SEN_R_FRONT);
	
	if( s_rightval >= 100 ){
		bl_check=TRUE;
	}
	else{
		bl_check=FALSE;
	}
	
	return bl_check;
}

// *************************************************************************
//   機能		： 前壁(左)が閾値以上だとフラグが立つ
//   注意		： なし
//   メモ		： なし
//   引数		： なし
//   返り値		： 検知した：true	検知できなかった：false
// **************************    履    歴    *******************************
// 		v1.0		2018.8.28			sato			新規
// *************************************************************************/
PUBLIC BOOL MODE_DistLeftCheck(){
	
	SHORT 	s_leftval;
	BOOL	bl_check;
	
	s_leftval 	= DIST_getNowVal(DIST_SEN_L_FRONT);
	
	if( s_leftval >= 100 ){
		bl_check = TRUE;
	
	}else{
		bl_check = FALSE;
	
	}
	
	return bl_check;
}

// *************************************************************************
//   機能		： 手をかざすと待機状態に入る
//   注意		： なし
//   メモ		： なし
//   引数		： なし
//   返り値		： 両方検知：true	それ以外：false
// **************************    履    歴    *******************************
// 		v1.0		2018.8.16			吉田			新規
// *************************************************************************/
PUBLIC BOOL MODE_setWaitCheck(){
	
	BOOL bl_check;
	
	if( TRUE == MODE_DistRightCheck() ){	// 右だけ検知
		LED4 = 0x0c;

	}
	if( TRUE == MODE_DistLeftCheck() ){		// 左だけ検知
		LED4 = 0x03;

	}
	
	if( ( TRUE == MODE_DistRightCheck() ) && ( TRUE == MODE_DistLeftCheck() ) ){
		LED4 = 0x0f;
		bl_check = TRUE;
		
	}else{
		bl_check = FALSE;
	
	}
	
	
	return bl_check;
}

// *************************************************************************
//   機能		： 手をかざすと待機状態に入り、かざしてから離すと実行
//   注意		： なし
//   メモ		： なし
//   引数		： なし
//   返り値		： 待機状態から抜け出す：true	それ以外：false
// **************************    履    歴    *******************************
// 		v1.0		2018.8.16			吉田			新規
// *************************************************************************/
PUBLIC BOOL MODE_CheckExe(){
	
	BOOL bl_check;
	
	if( TRUE == MODE_setWaitCheck() ){
		TIME_wait(200);
		
		if( FALSE == MODE_setWaitCheck() ){
			LED4 = 0x00;
			TIME_wait(1000);
			bl_check = TRUE;
			
		}else{
			bl_check = FALSE;
		
		}
		
	}else{
		
		bl_check = FALSE;
	}
	
	return bl_check;
}